//============================================================================
//文件名称：hw_gpio.h
//功能概要：K60 GPIO底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2011-11-13  V1.0   初始版本
//          2011-11-17  V1.1   规范排版风格
//============================================================================

#ifndef _GPIO_H
#define _GPIO_H

#ifdef __cplusplus
extern "C" {
#endif

	
//包含头文件

#include "common.h"          //包含公共类型定义
	
//宏定义

//芯片端口名定义
#define PORT_MAX_NUM 5  //端口数量

#define PORT_A 0
#define PORT_B 1
#define PORT_C 2
#define PORT_D 3
#define PORT_E 4

//函数接口声明

//============================================================================
//函数名称：hw_gpio_enable_port
//函数返回：无
//参数说明：无
//功能概要：加载所有GPIO端口的时钟。 供高层驱动调用。
//============================================================================
void hw_gpio_enable_port(void);

//============================================================================
//函数名称：hw_gpio_get_port_addr
//函数返回：端口号对应的端口寄存器组指针
//参数说明：无
//功能概要：将端口号转换成端口寄存器组指针。内部调用。
//============================================================================
PORT_MemMapPtr hw_gpio_get_port_addr (uint8 port);

//============================================================================
//函数名称：hw_gpio_get_pt_addr
//函数返回：端口号对应的GPIO端口寄存器组指针
//参数说明：无
//功能概要：将端口号转换成端口寄存器组指针。内部调用。
//============================================================================
GPIO_MemMapPtr hw_gpio_get_pt_addr(uint8 port);


//============================================================================
//函数名称：hw_gpio_init
//函数返回：函数执行状态。0=成功，其它为异常。
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//          dir：引脚方向。 1=输出，0=输入。
//          state：引脚初始状态。1=高电平，0=低电平
//功能概要：初始化端口作为GPIO引脚的功能。
//============================================================================
uint8 hw_gpio_init(uint8 port, uint8 pin, uint8 dir, uint8 state);

//============================================================================
//函数名称：hw_gpio_get
//函数返回：指定引脚状态。0=低电平，1=高电平。
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//功能概要：获取指定引脚状态。
//============================================================================
uint8 hw_gpio_get(uint8 port, uint8 pin);

//============================================================================
//函数名称：hw_gpio_set
//函数返回：无
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//          state：引脚初始状态。1=高电平，0=低电平
//功能概要：获取指定引脚状态。
//============================================================================
void hw_gpio_set(uint8 port, uint8 pin, uint8 state);

//============================================================================
//函数名称：hw_gpio_reverse
//函数返回：无
//参数说明：port：端口号。由宏定义。
//          pin：引脚号。0～31。
//功能概要：反转指定引脚状态。
//============================================================================
void hw_gpio_reverse(uint8 port, uint8 pin);

#ifdef __cplusplus
}
#endif

#endif
